# 6. 자료형 개념 배우기

int_data = 1                    ## 정수형 -1, 0, 1 과 같은 정수
float_data = 3.14               ## 실수형 -0.7, 3.14 등과 같은 분수로 표현 가능한 유리수, pi(원주율) 루트 2 같은 무리수를 포함하는 실수
complex_data = 1+5j             ## 실수부 + 허수부로 되어 있는 복소수 / Python 에서는 허수부를 j 로 표현한다
str_data1 = 'I Love Python'     ## 문자열 자료 한 글자 이상의 문자나 숫자, 기호 등으로 구성되어 있는 자료 / "" or '' 이용
str_data2 = "반갑습니다"         
list_data = [1,2,3]             ## 리스트 형 자료
tuple_data = (1,2,3)            ## 튜플 자료 , 기본적으로 리스트와 동일하지만 요소 값을 변경 불가능                
dic_data = {0:'False',1:'True'} ## 딕셔너리 자료
